Isolated Compute verification in ca-tor:

Provision IC using Terraform.
```
$ terraform apply
╷
│ Warning: Provider development overrides are in effect
│ 
│ The following provider development overrides are set in the CLI configuration:
│  - ibm-cloud/ibm in /Users/squarti/go/bin
│ 
│ The behavior may therefore not match any released version of the provider and applying changes may cause the state to become incompatible with published releases.
╵
data.ibm_resource_group.group: Reading...
data.ibm_resource_group.group: Read complete after 1s [id=eb922ba0717f47589ca26d202c5cc915]

Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # ibm_database.ssq_ic_tor_test_terraform will be created
  + resource "ibm_database" "ssq_ic_tor_test_terraform" {
      + adminuser               = (known after apply)
      + configuration_schema    = (known after apply)
      + connectionstrings       = (known after apply)
      + groups                  = (known after apply)
      + guid                    = (known after apply)
      + id                      = (known after apply)
      + location                = "ca-tor"
      + name                    = "ssq-ic-ca-tor-terraform"
      + plan                    = "standard"
      + resource_controller_url = (known after apply)
      + resource_crn            = (known after apply)
      + resource_group_id       = "eb922ba0717f47589ca26d202c5cc915"
      + resource_group_name     = (known after apply)
      + resource_name           = (known after apply)
      + resource_status         = (known after apply)
      + service                 = "databases-for-etcd"
      + service_endpoints       = "public"
      + status                  = (known after apply)
      + tags                    = (known after apply)
      + version                 = (known after apply)

      + group {
          + group_id = "member"

          + disk {
              + allocation_mb = 20480
            }

          + host_flavor {
              + id = "b3c.4x16.encrypted"
            }
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes

ibm_database.ssq_ic_tor_test_terraform: Creating...
ibm_database.ssq_ic_tor_test_terraform: Still creating... [10s elapsed]
ibm_database.ssq_ic_tor_test_terraform: Still creating... [20s elapsed]
ibm_database.ssq_ic_tor_test_terraform: Still creating... [30s elapsed]
ibm_database.ssq_ic_tor_test_terraform: Still creating... [40s elapsed]
ibm_database.ssq_ic_tor_test_terraform: Still creating... [50s elapsed]
ibm_database.ssq_ic_tor_test_terraform: Still creating... [1m0s elapsed]
ibm_database.ssq_ic_tor_test_terraform: Still creating... [1m10s elapsed]
ibm_database.ssq_ic_tor_test_terraform: Still creating... [1m20s elapsed]
ibm_database.ssq_ic_tor_test_terraform: Still creating... [1m30s elapsed]
ibm_database.ssq_ic_tor_test_terraform: Still creating... [1m40s elapsed]
ibm_database.ssq_ic_tor_test_terraform: Still creating... [1m50s elapsed]
ibm_database.ssq_ic_tor_test_terraform: Still creating... [2m0s elapsed]
ibm_database.ssq_ic_tor_test_terraform: Still creating... [2m10s elapsed]
ibm_database.ssq_ic_tor_test_terraform: Still creating... [2m20s elapsed]
ibm_database.ssq_ic_tor_test_terraform: Still creating... [2m30s elapsed]
ibm_database.ssq_ic_tor_test_terraform: Still creating... [2m40s elapsed]
ibm_database.ssq_ic_tor_test_terraform: Still creating... [2m50s elapsed]
ibm_database.ssq_ic_tor_test_terraform: Still creating... [3m0s elapsed]
ibm_database.ssq_ic_tor_test_terraform: Still creating... [3m10s elapsed]
ibm_database.ssq_ic_tor_test_terraform: Still creating... [3m20s elapsed]
ibm_database.ssq_ic_tor_test_terraform: Still creating... [3m30s elapsed]
ibm_database.ssq_ic_tor_test_terraform: Still creating... [3m40s elapsed]
ibm_database.ssq_ic_tor_test_terraform: Still creating... [3m50s elapsed]
ibm_database.ssq_ic_tor_test_terraform: Still creating... [4m0s elapsed]
ibm_database.ssq_ic_tor_test_terraform: Still creating... [4m10s elapsed]
ibm_database.ssq_ic_tor_test_terraform: Still creating... [4m20s elapsed]
ibm_database.ssq_ic_tor_test_terraform: Still creating... [4m30s elapsed]
ibm_database.ssq_ic_tor_test_terraform: Still creating... [4m40s elapsed]
ibm_database.ssq_ic_tor_test_terraform: Still creating... [4m50s elapsed]
ibm_database.ssq_ic_tor_test_terraform: Still creating... [5m0s elapsed]
ibm_database.ssq_ic_tor_test_terraform: Still creating... [5m10s elapsed]
ibm_database.ssq_ic_tor_test_terraform: Still creating... [5m20s elapsed]
ibm_database.ssq_ic_tor_test_terraform: Still creating... [5m30s elapsed]
ibm_database.ssq_ic_tor_test_terraform: Still creating... [5m40s elapsed]
ibm_database.ssq_ic_tor_test_terraform: Still creating... [5m50s elapsed]
ibm_database.ssq_ic_tor_test_terraform: Still creating... [6m0s elapsed]
ibm_database.ssq_ic_tor_test_terraform: Still creating... [6m10s elapsed]
ibm_database.ssq_ic_tor_test_terraform: Still creating... [6m20s elapsed]
ibm_database.ssq_ic_tor_test_terraform: Still creating... [6m30s elapsed]
ibm_database.ssq_ic_tor_test_terraform: Still creating... [6m40s elapsed]
ibm_database.ssq_ic_tor_test_terraform: Still creating... [6m50s elapsed]
ibm_database.ssq_ic_tor_test_terraform: Still creating... [7m0s elapsed]
ibm_database.ssq_ic_tor_test_terraform: Still creating... [7m10s elapsed]
ibm_database.ssq_ic_tor_test_terraform: Still creating... [7m20s elapsed]
ibm_database.ssq_ic_tor_test_terraform: Still creating... [7m30s elapsed]
ibm_database.ssq_ic_tor_test_terraform: Still creating... [7m40s elapsed]
ibm_database.ssq_ic_tor_test_terraform: Still creating... [7m50s elapsed]
ibm_database.ssq_ic_tor_test_terraform: Still creating... [8m0s elapsed]
ibm_database.ssq_ic_tor_test_terraform: Creation complete after 8m10s [id=crn:v1:bluemix:public:databases-for-etcd:ca-tor:a/40ddc34a953a8c02f10987b59085b60e:5261ce44-bc81-481b-b526-3db8937abdc8::]

Apply complete! Resources: 1 added, 0 changed, 0 destroyed.
```

Scaling IC using Terraform:
```
$ terraform apply
╷
│ Warning: Provider development overrides are in effect
│ 
│ The following provider development overrides are set in the CLI configuration:
│  - ibm-cloud/ibm in /Users/squarti/go/bin
│ 
│ The behavior may therefore not match any released version of the provider and applying changes may cause the state to become incompatible with published releases.
╵
data.ibm_resource_group.group: Reading...
data.ibm_resource_group.group: Read complete after 1s [id=eb922ba0717f47589ca26d202c5cc915]
ibm_database.ssq_ic_tor_test_terraform: Refreshing state... [id=crn:v1:bluemix:public:databases-for-etcd:ca-tor:a/40ddc34a953a8c02f10987b59085b60e:5261ce44-bc81-481b-b526-3db8937abdc8::]

Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:
  ~ update in-place

Terraform will perform the following actions:

  # ibm_database.ssq_ic_tor_test_terraform will be updated in-place
  ~ resource "ibm_database" "ssq_ic_tor_test_terraform" {
        id                      = "crn:v1:bluemix:public:databases-for-etcd:ca-tor:a/40ddc34a953a8c02f10987b59085b60e:5261ce44-bc81-481b-b526-3db8937abdc8::"
        name                    = "ssq-ic-ca-tor-terraform"
        tags                    = []
        # (16 unchanged attributes hidden)

      - group {
          - group_id = "member" -> null

          - disk {
              - allocation_mb = 20480 -> null
            }

          - host_flavor {
              - id = "b3c.4x16.encrypted" -> null
            }
        }
      + group {
          + group_id = "member"

          + disk {
              + allocation_mb = 20480
            }

          + host_flavor {
              + id = "b3c.8x32.encrypted"
            }
        }

        # (1 unchanged block hidden)
    }

Plan: 0 to add, 1 to change, 0 to destroy.

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes

ibm_database.ssq_ic_tor_test_terraform: Modifying... [id=crn:v1:bluemix:public:databases-for-etcd:ca-tor:a/40ddc34a953a8c02f10987b59085b60e:5261ce44-bc81-481b-b526-3db8937abdc8::]
ibm_database.ssq_ic_tor_test_terraform: Still modifying... [id=crn:v1:bluemix:public:databases-for-etc...5261ce44-bc81-481b-b526-3db8937abdc8::, 10s elapsed]
ibm_database.ssq_ic_tor_test_terraform: Still modifying... [id=crn:v1:bluemix:public:databases-for-etc...5261ce44-bc81-481b-b526-3db8937abdc8::, 20s elapsed]
ibm_database.ssq_ic_tor_test_terraform: Still modifying... [id=crn:v1:bluemix:public:databases-for-etc...5261ce44-bc81-481b-b526-3db8937abdc8::, 30s elapsed]
ibm_database.ssq_ic_tor_test_terraform: Still modifying... [id=crn:v1:bluemix:public:databases-for-etc...5261ce44-bc81-481b-b526-3db8937abdc8::, 40s elapsed]
ibm_database.ssq_ic_tor_test_terraform: Still modifying... [id=crn:v1:bluemix:public:databases-for-etc...5261ce44-bc81-481b-b526-3db8937abdc8::, 50s elapsed]
ibm_database.ssq_ic_tor_test_terraform: Still modifying... [id=crn:v1:bluemix:public:databases-for-etc...5261ce44-bc81-481b-b526-3db8937abdc8::, 1m0s elapsed]
ibm_database.ssq_ic_tor_test_terraform: Still modifying... [id=crn:v1:bluemix:public:databases-for-etc...5261ce44-bc81-481b-b526-3db8937abdc8::, 1m10s elapsed]
ibm_database.ssq_ic_tor_test_terraform: Still modifying... [id=crn:v1:bluemix:public:databases-for-etc...5261ce44-bc81-481b-b526-3db8937abdc8::, 1m20s elapsed]
ibm_database.ssq_ic_tor_test_terraform: Still modifying... [id=crn:v1:bluemix:public:databases-for-etc...5261ce44-bc81-481b-b526-3db8937abdc8::, 1m30s elapsed]
ibm_database.ssq_ic_tor_test_terraform: Still modifying... [id=crn:v1:bluemix:public:databases-for-etc...5261ce44-bc81-481b-b526-3db8937abdc8::, 1m40s elapsed]
ibm_database.ssq_ic_tor_test_terraform: Still modifying... [id=crn:v1:bluemix:public:databases-for-etc...5261ce44-bc81-481b-b526-3db8937abdc8::, 1m50s elapsed]
ibm_database.ssq_ic_tor_test_terraform: Still modifying... [id=crn:v1:bluemix:public:databases-for-etc...5261ce44-bc81-481b-b526-3db8937abdc8::, 2m0s elapsed]
ibm_database.ssq_ic_tor_test_terraform: Still modifying... [id=crn:v1:bluemix:public:databases-for-etc...5261ce44-bc81-481b-b526-3db8937abdc8::, 2m10s elapsed]
ibm_database.ssq_ic_tor_test_terraform: Still modifying... [id=crn:v1:bluemix:public:databases-for-etc...5261ce44-bc81-481b-b526-3db8937abdc8::, 2m20s elapsed]
ibm_database.ssq_ic_tor_test_terraform: Still modifying... [id=crn:v1:bluemix:public:databases-for-etc...5261ce44-bc81-481b-b526-3db8937abdc8::, 2m30s elapsed]
ibm_database.ssq_ic_tor_test_terraform: Still modifying... [id=crn:v1:bluemix:public:databases-for-etc...5261ce44-bc81-481b-b526-3db8937abdc8::, 2m40s elapsed]
ibm_database.ssq_ic_tor_test_terraform: Still modifying... [id=crn:v1:bluemix:public:databases-for-etc...5261ce44-bc81-481b-b526-3db8937abdc8::, 2m50s elapsed]
ibm_database.ssq_ic_tor_test_terraform: Still modifying... [id=crn:v1:bluemix:public:databases-for-etc...5261ce44-bc81-481b-b526-3db8937abdc8::, 3m0s elapsed]
ibm_database.ssq_ic_tor_test_terraform: Still modifying... [id=crn:v1:bluemix:public:databases-for-etc...5261ce44-bc81-481b-b526-3db8937abdc8::, 3m10s elapsed]
ibm_database.ssq_ic_tor_test_terraform: Still modifying... [id=crn:v1:bluemix:public:databases-for-etc...5261ce44-bc81-481b-b526-3db8937abdc8::, 3m20s elapsed]
ibm_database.ssq_ic_tor_test_terraform: Still modifying... [id=crn:v1:bluemix:public:databases-for-etc...5261ce44-bc81-481b-b526-3db8937abdc8::, 3m30s elapsed]
ibm_database.ssq_ic_tor_test_terraform: Still modifying... [id=crn:v1:bluemix:public:databases-for-etc...5261ce44-bc81-481b-b526-3db8937abdc8::, 3m40s elapsed]
ibm_database.ssq_ic_tor_test_terraform: Still modifying... [id=crn:v1:bluemix:public:databases-for-etc...5261ce44-bc81-481b-b526-3db8937abdc8::, 3m50s elapsed]
ibm_database.ssq_ic_tor_test_terraform: Still modifying... [id=crn:v1:bluemix:public:databases-for-etc...5261ce44-bc81-481b-b526-3db8937abdc8::, 4m0s elapsed]
ibm_database.ssq_ic_tor_test_terraform: Still modifying... [id=crn:v1:bluemix:public:databases-for-etc...5261ce44-bc81-481b-b526-3db8937abdc8::, 4m10s elapsed]
ibm_database.ssq_ic_tor_test_terraform: Still modifying... [id=crn:v1:bluemix:public:databases-for-etc...5261ce44-bc81-481b-b526-3db8937abdc8::, 4m20s elapsed]
ibm_database.ssq_ic_tor_test_terraform: Still modifying... [id=crn:v1:bluemix:public:databases-for-etc...5261ce44-bc81-481b-b526-3db8937abdc8::, 4m30s elapsed]
ibm_database.ssq_ic_tor_test_terraform: Still modifying... [id=crn:v1:bluemix:public:databases-for-etc...5261ce44-bc81-481b-b526-3db8937abdc8::, 4m40s elapsed]
ibm_database.ssq_ic_tor_test_terraform: Still modifying... [id=crn:v1:bluemix:public:databases-for-etc...5261ce44-bc81-481b-b526-3db8937abdc8::, 4m50s elapsed]
ibm_database.ssq_ic_tor_test_terraform: Still modifying... [id=crn:v1:bluemix:public:databases-for-etc...5261ce44-bc81-481b-b526-3db8937abdc8::, 5m0s elapsed]
ibm_database.ssq_ic_tor_test_terraform: Still modifying... [id=crn:v1:bluemix:public:databases-for-etc...5261ce44-bc81-481b-b526-3db8937abdc8::, 5m10s elapsed]
ibm_database.ssq_ic_tor_test_terraform: Still modifying... [id=crn:v1:bluemix:public:databases-for-etc...5261ce44-bc81-481b-b526-3db8937abdc8::, 5m20s elapsed]
ibm_database.ssq_ic_tor_test_terraform: Still modifying... [id=crn:v1:bluemix:public:databases-for-etc...5261ce44-bc81-481b-b526-3db8937abdc8::, 5m30s elapsed]
ibm_database.ssq_ic_tor_test_terraform: Still modifying... [id=crn:v1:bluemix:public:databases-for-etc...5261ce44-bc81-481b-b526-3db8937abdc8::, 5m40s elapsed]
ibm_database.ssq_ic_tor_test_terraform: Still modifying... [id=crn:v1:bluemix:public:databases-for-etc...5261ce44-bc81-481b-b526-3db8937abdc8::, 5m50s elapsed]
ibm_database.ssq_ic_tor_test_terraform: Still modifying... [id=crn:v1:bluemix:public:databases-for-etc...5261ce44-bc81-481b-b526-3db8937abdc8::, 6m0s elapsed]
ibm_database.ssq_ic_tor_test_terraform: Still modifying... [id=crn:v1:bluemix:public:databases-for-etc...5261ce44-bc81-481b-b526-3db8937abdc8::, 6m10s elapsed]
ibm_database.ssq_ic_tor_test_terraform: Still modifying... [id=crn:v1:bluemix:public:databases-for-etc...5261ce44-bc81-481b-b526-3db8937abdc8::, 6m20s elapsed]
ibm_database.ssq_ic_tor_test_terraform: Still modifying... [id=crn:v1:bluemix:public:databases-for-etc...5261ce44-bc81-481b-b526-3db8937abdc8::, 6m30s elapsed]
ibm_database.ssq_ic_tor_test_terraform: Still modifying... [id=crn:v1:bluemix:public:databases-for-etc...5261ce44-bc81-481b-b526-3db8937abdc8::, 6m40s elapsed]
ibm_database.ssq_ic_tor_test_terraform: Still modifying... [id=crn:v1:bluemix:public:databases-for-etc...5261ce44-bc81-481b-b526-3db8937abdc8::, 6m50s elapsed]
ibm_database.ssq_ic_tor_test_terraform: Still modifying... [id=crn:v1:bluemix:public:databases-for-etc...5261ce44-bc81-481b-b526-3db8937abdc8::, 7m0s elapsed]
ibm_database.ssq_ic_tor_test_terraform: Still modifying... [id=crn:v1:bluemix:public:databases-for-etc...5261ce44-bc81-481b-b526-3db8937abdc8::, 7m10s elapsed]
ibm_database.ssq_ic_tor_test_terraform: Still modifying... [id=crn:v1:bluemix:public:databases-for-etc...5261ce44-bc81-481b-b526-3db8937abdc8::, 7m20s elapsed]
ibm_database.ssq_ic_tor_test_terraform: Still modifying... [id=crn:v1:bluemix:public:databases-for-etc...5261ce44-bc81-481b-b526-3db8937abdc8::, 7m30s elapsed]
ibm_database.ssq_ic_tor_test_terraform: Still modifying... [id=crn:v1:bluemix:public:databases-for-etc...5261ce44-bc81-481b-b526-3db8937abdc8::, 7m40s elapsed]
ibm_database.ssq_ic_tor_test_terraform: Still modifying... [id=crn:v1:bluemix:public:databases-for-etc...5261ce44-bc81-481b-b526-3db8937abdc8::, 7m50s elapsed]
ibm_database.ssq_ic_tor_test_terraform: Still modifying... [id=crn:v1:bluemix:public:databases-for-etc...5261ce44-bc81-481b-b526-3db8937abdc8::, 8m0s elapsed]
ibm_database.ssq_ic_tor_test_terraform: Still modifying... [id=crn:v1:bluemix:public:databases-for-etc...5261ce44-bc81-481b-b526-3db8937abdc8::, 8m10s elapsed]
ibm_database.ssq_ic_tor_test_terraform: Still modifying... [id=crn:v1:bluemix:public:databases-for-etc...5261ce44-bc81-481b-b526-3db8937abdc8::, 8m21s elapsed]
ibm_database.ssq_ic_tor_test_terraform: Still modifying... [id=crn:v1:bluemix:public:databases-for-etc...5261ce44-bc81-481b-b526-3db8937abdc8::, 8m31s elapsed]
ibm_database.ssq_ic_tor_test_terraform: Still modifying... [id=crn:v1:bluemix:public:databases-for-etc...5261ce44-bc81-481b-b526-3db8937abdc8::, 8m41s elapsed]
ibm_database.ssq_ic_tor_test_terraform: Still modifying... [id=crn:v1:bluemix:public:databases-for-etc...5261ce44-bc81-481b-b526-3db8937abdc8::, 8m51s elapsed]
ibm_database.ssq_ic_tor_test_terraform: Still modifying... [id=crn:v1:bluemix:public:databases-for-etc...5261ce44-bc81-481b-b526-3db8937abdc8::, 9m1s elapsed]
ibm_database.ssq_ic_tor_test_terraform: Still modifying... [id=crn:v1:bluemix:public:databases-for-etc...5261ce44-bc81-481b-b526-3db8937abdc8::, 9m11s elapsed]
ibm_database.ssq_ic_tor_test_terraform: Still modifying... [id=crn:v1:bluemix:public:databases-for-etc...5261ce44-bc81-481b-b526-3db8937abdc8::, 9m21s elapsed]
ibm_database.ssq_ic_tor_test_terraform: Still modifying... [id=crn:v1:bluemix:public:databases-for-etc...5261ce44-bc81-481b-b526-3db8937abdc8::, 9m31s elapsed]
ibm_database.ssq_ic_tor_test_terraform: Still modifying... [id=crn:v1:bluemix:public:databases-for-etc...5261ce44-bc81-481b-b526-3db8937abdc8::, 9m41s elapsed]
ibm_database.ssq_ic_tor_test_terraform: Still modifying... [id=crn:v1:bluemix:public:databases-for-etc...5261ce44-bc81-481b-b526-3db8937abdc8::, 9m51s elapsed]
ibm_database.ssq_ic_tor_test_terraform: Modifications complete after 9m57s [id=crn:v1:bluemix:public:databases-for-etcd:ca-tor:a/40ddc34a953a8c02f10987b59085b60e:5261ce44-bc81-481b-b526-3db8937abdc8::]

Apply complete! Resources: 0 added, 1 changed, 0 destroyed.
```